result_thread_200508/thread_20_nvm_sw_3400_0_aofoff.txt
shm_addr = 7000
shm_addr = 7000
shm_addr = 7000
[...]
======================================
 all_ops == 2000000
 test_time == 24.878966
 Throughput == 80389.193024
 ======================================
20        Threads
1         Connections per thread
100000    Requests per client


ALL STATS
=========================================================================
Type         Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
-------------------------------------------------------------------------
Sets        80261.29          ---          ---      0.24500     84093.10 
Gets            0.00         0.00         0.00      0.00000         0.00 
Waits           0.00          ---          ---      0.00000          --- 
Totals      80261.29         0.00         0.00      0.24500     84093.10 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.021         0.00
SET       0.022         0.00
SET       0.023         0.00
SET       0.024         0.01
SET       0.025         0.01
SET       0.026         0.01
SET       0.027         0.01
SET       0.028         0.01
SET       0.029         0.01
SET       0.030         0.01
SET       0.031         0.01
SET       0.032         0.01
SET       0.033         0.01
SET       0.034         0.01
SET       0.035         0.01
SET       0.036         0.02
SET       0.037         0.02
SET       0.038         0.02
SET       0.039         0.02
SET       0.040         0.02
SET       0.041         0.02
SET       0.042         0.02
SET       0.043         0.02
SET       0.044         0.02
SET       0.045         0.02
SET       0.046         0.02
SET       0.047         0.02
SET       0.048         0.02
SET       0.049         0.02
SET       0.050         0.02
SET       0.051         0.03
SET       0.052         0.03
SET       0.053         0.03
SET       0.054         0.03
SET       0.055         0.03
SET       0.056         0.03
SET       0.057         0.03
SET       0.058         0.03
SET       0.059         0.03
SET       0.060         0.03
SET       0.061         0.03
SET       0.062         0.03
SET       0.063         0.03
SET       0.064         0.03
SET       0.065         0.03
SET       0.066         0.04
SET       0.067         0.04
SET       0.068         0.04
SET       0.069         0.04
SET       0.070         0.04
SET       0.071         0.04
SET       0.072         0.04
SET       0.073         0.04
SET       0.074         0.05
SET       0.075         0.05
SET       0.076         0.05
SET       0.077         0.05
SET       0.078         0.05
SET       0.079         0.05
SET       0.080         0.06
SET       0.081         0.06
SET       0.082         0.06
SET       0.083         0.06
SET       0.084         0.06
SET       0.085         0.07
SET       0.086         0.07
SET       0.087         0.07
SET       0.088         0.07
SET       0.089         0.07
SET       0.090         0.07
SET       0.091         0.08
SET       0.092         0.08
SET       0.093         0.08
SET       0.094         0.08
SET       0.095         0.08
SET       0.096         0.08
SET       0.097         0.09
SET       0.098         0.09
SET       0.099         0.09
SET       0.100         0.10
SET       0.110         0.13
SET       0.120         0.15
SET       0.130         0.17
SET       0.140         0.18
SET       0.150         0.20
SET       0.160         0.24
SET       0.170         0.33
SET       0.180         1.60
SET       0.190         8.25
SET       0.200        18.75
SET       0.210        31.31
SET       0.220        47.97
SET       0.230        61.27
SET       0.240        65.54
SET       0.250        67.33
SET       0.260        69.20
SET       0.270        71.59
SET       0.280        74.59
SET       0.290        78.27
SET       0.300        82.54
SET       0.310        86.86
SET       0.320        90.66
SET       0.330        93.81
SET       0.340        96.18
SET       0.350        97.57
SET       0.360        98.18
SET       0.370        98.46
SET       0.380        98.65
SET       0.390        98.84
SET       0.400        99.06
SET       0.410        99.32
SET       0.420        99.59
SET       0.430        99.80
SET       0.440        99.92
SET       0.450        99.96
SET       0.460        99.98
SET       0.470        99.99
SET       0.480        99.99
SET       0.490        99.99
SET       0.500        99.99
SET       0.510        99.99
SET       0.520        99.99
SET       0.530        99.99
SET       0.540        99.99
SET       0.550        99.99
SET       0.560        99.99
SET       0.570        99.99
SET       0.580        99.99
SET       0.590       100.00
SET       0.600       100.00
SET       0.610       100.00
SET       0.620       100.00
SET       0.630       100.00
SET       0.640       100.00
SET       0.650       100.00
SET       0.660       100.00
SET       0.670       100.00
SET       0.680       100.00
SET       0.690       100.00
SET       0.700       100.00
SET       0.720       100.00
SET       0.730       100.00
SET       0.740       100.00
SET       0.750       100.00
SET       0.770       100.00
SET       0.780       100.00
SET       0.810       100.00
SET       0.820       100.00
SET       0.830       100.00
SET       0.840       100.00
SET       0.850       100.00
SET       0.880       100.00
SET       0.900       100.00
SET       0.920       100.00
SET       0.940       100.00
SET       0.980       100.00
SET       1.000       100.00
SET       1.200       100.00
SET       1.400       100.00
SET       1.500       100.00
SET       2.100       100.00
SET       2.200       100.00
SET       2.300       100.00
SET       2.400       100.00
---
---